Revit 2026 API

# RebarBendingDetailGetTagRelativeRotation Method

---

Gets the embedded tag rotation angle w.r.t. the realistic bending detail element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static double GetTagRelativeRotation(
	Element bendingDetail
)
```
```vb
Public Shared Function GetTagRelativeRotation (
	bendingDetail As Element
) As Double
```
```cpp
public:
static double GetTagRelativeRotation(
	Element^ bendingDetail
)
```
```fsharp
static member GetTagRelativeRotation :
        bendingDetail : Element -> float
```

#### Parameters

bendingDetail Element
     The bending detail element.

#### Return Value

Double The rotation angle of the embedded tag w.r.t. the bending detail element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This option is only available for realistic bending detail elements. |
| ArgumentNullException | A non-optional argument was null |

This function is exclusive to realistic bending detail mode.

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace